Tekla.Structures.Model.Internal.ProgressReportCallbackClient
Progress report callback client.

Tekla.Structures.Model.Internal.ProgressReportCallbackClient.callback
The delegate to call when the progress is updated.

Tekla.Structures.Model.Internal.ProgressReportCallbackClient.#ctor(Tekla.Structures.Model.Internal.ProgressReportDelegate)
Creates a new instance of the Tekla.Structures.Model.Internal.ProgressReportCallbackClient class.
callback: The delegate to call when the progress is updated.

Tekla.Structures.Model.Internal.ProgressReportCallbackClient.OnProgressChanged(System.String,System.Int32)
